#_author: liuz
#date: 2017/12/2

#元祖的概念
'''
Python的元组与列表类似，不同之处在于元组的元素不能修改。
元组使用小括号，列表使用方括号。
元组创建很简单，只需要在括号中添加元素，
并使用逗号隔开即可。
单个元祖也要加逗号
元祖可以添加list
'''
#注意：元组中的元素值是不允许删除的，但我们可以使用del语句来删除整个元组，
a=(1,2,3)    #定义元祖
print(a[1:]) #取值和列表方法相同 通过索引切片获取 (2,3)
print(len(a)) #取长度
#del a

#元祖不能修改值
# 以下修改元组元素操作是非法的。
#tup1 = (12, 34.56);
#tup2 = ('abc', 'xyz');

# tup1[0] = 100;  #报错

# 创建一个新的元组
#tup3 = tup1 + tup2;
#rint tup3;

#元祖的作用：。。。。。。。。。

'''
元祖的函数
1	cmp(tuple1, tuple2)
比较两个元组元素。
2	len(tuple)
计算元组元素个数。
3	max(tuple)
返回元组中元素最大值。
4	min(tuple)
返回元组中元素最小值。
5	tuple(seq)
将列表转换为元组。

'''