#_author: liuz
#date: 2017/12/9

#学习装饰器
#学习知识点
#1.函数作用域
#2.高阶函数   2.1函数名作为参数输入   2.2 函数名可以作为返回值
#3.闭包


#****************************************学习闭包******************************************
#函数内部可以嵌套函数
def outer():       #outer(x)参数传入x也是一个外部变量
    x=10
    def inner():   #条件1 是一个内部函数
        print(x)   #条件2 x是一个外部环境的变量
    return inner   #结论：内部函数inner就是一个闭包


#调用inner() 几种方式
#1.1
#outer()()
#1.2
inner2=outer()
inner2()

#思考  inner2() 执行 为何能打印x 因为x定义在outer()函数里面
    #答：因为inner() 是一个闭包函数 所以能执行

#闭包的定义
#如果在一个内部函数里，对一个外部作用域进行引用（但不是全局作用域变量)，那么内部函数就被认为是闭包
#inner() 是一个内部函数,外部作用域就是x进行了引用

#关于闭包：闭包=函数块+定义函数时的环境
